isaac_flavor_text = {
    "no12": {
        "id": [6, 378],
        "text": "大便当 饭，小便当 汤。"
    },
    "real_crap": {
        "id": [36],
        "text": "哦咩得多！也是吃上好的了。"
    },
    "oh_crap": {
        "id": [9, 36, 209, 236, 291, 378, 504, 543, 576, 680, 725],
        "text": "真香！"
    },
    "guppy": {
        "id": [81, 133, 134, 145, 187, 212, 665],
        "text": "爱猫TV启动！"
    },
    "bookworm": {
        "id": [33, 34, 35, 58, 65, 78, 97, 123, 192, 282, 287, 292, 545, 584, 712],
        "text": "知识就是力量。"
    },
    "dataminer": {
        "id": [489],
        "text": "XCSmDBRlDB5pNLmuhdGyg3WtECNlgLq2EBVlDBcagrZlfB4lDXGegBKxgHGtg3AeEXGagnGmNLmugLb="
    },
    "spun": {
        "id": [13, 14, 70, 143, 240, 345, 493, 496],
        "text": "给我家鸽子用的。"
    },
    "fun_guy": {
        "id": [11, 12, 71, 120, 121, 342, 398, 553, 582, 625],
        "text": "我说怎么踩到刺不掉血，原来我在天上飞啊。"
    },
    "TMTrainer": {
        "id": [721],
        "text": "\\\"TMTrainer\\\": {\\n\\t\\\"id\\\": [721],\\n\\\"text\\\": \\\"Default flavor text.\\\"}\\\""
    },
    "greatness": {
        "id": [691],
        "text": "注定伟大！"
    },
    "void": {
        "id": [477, 706],
        "text": "这下没得吃了..."
    },
    "lost": {
        "id": [612],
        "text": "饿啊..."
    },
    "binge_eater": {
        "id": [664],
        "text": "Bon appetit!"
    },
    "echo_chamber": {
        "id": [700],
        "text": "声室吧！室吧！吧！"
    },
    "angel": {
        "id": [33, 78, 101, 108, 182, 313, 331, 333, 334, 335, 499, 573],
        "text": "✝升天✝"
    },
    "bomb": {
        "id": [125, 220, 37, 131, 209, 250, 256, 353, 367, 432, 517, 563, 646, 727, 366, 614, 483, 190, 106, 19, 42, 65, 137, 140, 223, 583, 40, 401, 52, 371],
        "text": "爆！！！"
    },
    "bob": {
        "id": [42, 140, 149, 273],
        "text": "臭死了。"
    },
    "sharp": {
        "id": [114, 126, 486, 555, 443, 339, 656, 448, 627, 631],
        "text": "吃之前先在自己的手上改个花刀吧。"
    },
    "gulp": {
        "id": [538],
        "text": "Gulp!"
    }
}

isaac_extra_labels = {
    "speed_change": {
        "label_id": 1,
        "item_id": [77, 83, 130, 181, 298, 406, 477, 481, 12, 13, 14, 27, 28, 70, 71, 79, 82, 90, 101, 119, 120, 121, 122, 129, 143, 189, 230, 232, 240, 258, 299, 300, 304, 306, 307, 314, 340, 407, 440, 445],
        "description": "这个道具可以改变人物的移速。"
    },
    "range_change": {
        "label_id": 2,
        "item_id": [5, 6, 12, 14, 29, 30, 31, 71, 101, 110, 121, 182, 197, 214, 224, 254, 258, 304, 307, 331, 336, 339, 345, 355, 369, 370, 394, 397, 407, 440, 442, 453, 455, 572, 659, 669, 716, 192, 406, 481, 625],
        "description": "这个道具可以改变人物的射程。"
    },
    "tears_bounded": {
        "label_id": 3,
        "item_id": [1, 6, 32, 72, 80, 90, 101, 115, 120, 182, 183, 189, 196, 237, 255, 331, 341, 342, 370, 381, 394, 438, 443, 465, 547, 564, 598, 601, 669, 671, 686],
        "description": "这个道具可以改变人物的射速加成(非修正)。"
    },
    "shotspeed_change": {
        "label_id": 4,
        "item_id": [5, 143, 165, 176, 182, 183, 194, 213, 240, 255, 258, 310, 331, 336, 339, 341, 342, 397, 415, 442, 477, 481, 564, 572, 669, 731],
        "description": "这个道具可以改变人物的弹速。"
    },
    "damage_change": {
        "label_id": 5,
        "item_id": [83, 126, 406, 477, 481, 487, 555, 556, 625, 4, 7, 12, 50, 51, 70, 79, 80, 90, 101, 118, 120, 121, 122, 132, 138, 149, 152, 154, 157, 165, 169, 182, 189, 193, 197, 201, 206, 208, 216, 230, 237, 240, 254, 258, 259, 261, 307, 330, 331, 345, 359, 373, 399, 407, 411, 155, 415, 445, 463, 493, 513, 530, 531, 533, 561, 569, 572, 573, 592, 621, 633, 664, 669, 673, 694, 708, 62, 605, 671, 686, 716, 730, 731, 732],
        "description": "这个道具可以改变人物的伤害。"
    },
    "luck_change": {
        "label_id": 6,
        "item_id": [439, 481, 343, 46, 253, 258, 355, 492, 671, 644, 632, 669, 588, 686, 730],
        "description": "这个道具可以改变人物的幸运。"
    },
    "falling_change": {
        "label_id": 7,
        "item_id": [369, 336, 331, 101, 149, 197, 440, 12, 394, 399, 71, 110, 30, 31, 355, 29, 370, 5, 6, 121, 407, 14, 182, 339, 189, 345, 442, 233, 397, 453],
        "description": "在忏悔以前的版本，这个道具可以改变人物的泪弹上抛速度。"
    },
    "knockback": {
        "label_id": 8,
        "item_id": [309, 359, 592, 637, 690],
        "description": "这个道具可以使人物或人物的泪弹具有击退效果。"
    },
    "round_kncokback": {
        "label_id": 9,
        "item_id": [294, 36, 276, 404],
        "description": "这个道具具有环状击退效果。"
    },
    "height_change": {
        "label_id": 10,
        "item_id": [572, 594, 598, 688, 625, 192, 6, 440, 431, 461],
        "description": "这个道具会改变人物的泪弹高度。"
    },
    "burn_effect": {
        "label_id": 11,
        "item_id": [257, 570],
        "description": "这个道具或拾取过这个道具的人物可以使敌人燃烧。"
    },
    "love_effect": {
        "label_id": 12,
        "item_id": [421, 207, 513, 432, 200, 570, 591],
        "description": "这个道具或拾取过这个道具的人物可以使敌人魅惑。"
    },
    "confuse_effect": {
        "label_id": 13,
        "item_id": [209, 201, 460, 497, 637],
        "description": "这个道具或拾取过这个道具的人物可以使敌人混乱。"
    },
    "fear_effect": {
        "label_id": 14,
        "item_id": [41, 93, 230, 259, 228, 433, 400, 513, 554, 570],
        "description": "这个道具或拾取过这个道具的人物可以使敌人恐惧。"
    },
    "rock_effect": {
        "label_id": 15,
        "item_id": [338, 351, 39, 110, 202, 372, 546, 450, 570, 608],
        "description": "这个道具或拾取过这个道具的人物可以使敌人石化。"
    },
    "poison_effect": {
        "label_id": 16,
        "item_id": [111, 42, 351, 180, 273, 140, 103, 149, 305, 13, 725, 466, 393, 350, 491, 404, 446, 553, 570, 594],
        "description": "这个道具或拾取过这个道具的人物可以使敌人中毒。"
    },
    "slowdown_effect": {
        "label_id": 17,
        "item_id": [66, 171, 231, 266, 337, 99, 89, 232, 387, 425, 570, 608, 575, 596],
        "description": "这个道具或拾取过这个道具的人物可以使敌人减速。"
    },
    "friendly_effect": {
        "label_id": 18,
        "item_id": [382, 545, 510, 687, 433, 468, 505, 539],
        "description": "这个道具可以生成友好的怪物跟班。"
    },
    "small_effect": {
        "label_id": 19,
        "item_id": [398],
        "description": "这个道具或拾取过这个道具的人物可以使敌人缩小。"
    },
    "bleed_effect": {
        "label_id": 20,
        "item_id": [506, 508],
        "description": "这个道具或拾取过这个道具的人物可以使敌人流血。"
    },
    "bondage_effect": {
        "label_id": 21,
        "item_id": [722],
        "description": "这个道具或拾取过这个道具的人物可以使敌人束缚。"
    },
    "freeze_effect": {
        "label_id": 22,
        "item_id": [570, 652, 608, 596],
        "description": "这个道具或拾取过这个道具的人物可以使敌人冻结。"
    },
    "mark_effect": {
        "label_id": 23,
        "item_id": [618, 570],
        "description": "这个道具或拾取过这个道具的人物可以使敌人易受其他敌人的攻击。"
    },
    "magnet_effect": {
        "label_id": 24,
        "item_id": [617],
        "description": "这个道具或拾取过这个道具的人物可以使敌人磁化。"
    },
    "random_effect": {
        "label_id": 25,
        "item_id": [174, 191, 403, 405, 418, 570, 211],
        "description": "这个道具或拾取过这个道具的人物泪弹可以产生随机效果。"
    },
    "homing_tears": {
        "label_id": 26,
        "item_id": [192, 3, 182, 331, 543, 570, 651, 100, 390],
        "description": "这个道具或拾取过这个道具的人物可以发射追踪泪弹。"
    },
    "piercing_tears": {
        "label_id": 27,
        "item_id": [48, 306, 336, 237, 462, 533],
        "description": "这个道具可以使角色发射穿刺泪弹。"
    },
    "spectral_tears": {
        "label_id": 28,
        "item_id": [115, 185, 159, 336, 233, 369, 379, 358, 163],
        "description": "这个道具或拾取过这个道具的人物可以发射灵体泪弹。"
    },
    "invincibility": {
        "label_id": 29,
        "item_id": [77, 93, 298, 299, 326],
        "description": "这个道具可以使角色进入无敌状态(非护盾)。"
    },
    "shield": {
        "label_id": 30,
        "item_id": [58, 162, 303, 327, 409, 326, 593],
        "description": "这个道具可以赋予角色无敌护盾。"
    },
    "berserk": {
        "label_id": 31,
        "item_id": [704],
        "description": "这个道具可以使角色进入狂暴。"
    },
    "flight": {
        "label_id": 32,
        "item_id": [130, 33, 107, 181, 703, 185, 179, 184, 82, 159, 20, 409, 677, 633, 643, 674],
        "description": "这个道具可以使角色获得飞行。"
    },
    "revive": {
        "label_id": 33,
        "item_id": [11, 332, 81, 688, 212, 161, 311, 619],
        "description": "在某些条件下，这个道具可以使角色复活。"
    },
    "follow_familiar": {
        "label_id": 34,
        "item_id": [8, 11, 67, 81, 94, 95, 96, 98, 99, 100, 113, 131, 163, 174, 178, 238, 239, 265, 266, 268, 269, 271, 273, 275, 276, 319, 322, 360, 361, 362, 372, 387, 389, 390, 404, 405, 436, 469, 471, 472, 473, 491, 500, 518, 537, 539, 543, 548, 575, 610],
        "description": "这个道具可以生成跟随角色的跟班。"
    },
    "surround_familiar": {
        "label_id": 35,
        "item_id": [10, 57, 73, 112, 128, 172, 207, 264, 274, 279, 363, 364, 508, 509, 581, 629, 645, 655, 693, 702, 712],
        "description": "这个道具可以生成环绕角色的跟班。"
    },
    "float_familiar": {
        "label_id": 36,
        "item_id": [155, 272, 417, 470],
        "description": "这个道具可以生成漂浮在房间中，碰到墙壁会反弹的跟班。"
    },
    "control_familiar": {
        "label_id": 37,
        "item_id": [267, 320, 635],
        "description": "这个道具可以生成需要玩家自己控制的跟班。"
    },
    "all_familiar": {
        "label_id": 38,
        "item_id": [8, 10, 11, 57, 67, 73, 81, 88, 94, 95, 96, 98, 99, 100, 107, 112, 113, 117, 128, 131, 144, 155, 163, 167, 170, 172, 174, 178, 187, 188, 206, 207, 238, 239, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 318, 319, 320, 321, 322, 325, 357, 360, 361, 362, 363, 364, 365, 372, 384, 385, 387, 388, 389, 390, 403, 404, 405, 417, 426, 430, 431, 433, 435, 436, 467, 468, 469, 470, 471, 472, 473, 491, 492, 500, 504, 508, 509, 511, 516, 518, 519, 525, 526, 528, 537, 539, 542, 543, 544, 548, 565, 567, 569, 575, 577, 581, 605, 607, 608, 610, 612, 615, 626, 627, 629, 635, 645, 649, 651, 652, 655, 656, 667, 679, 681, 682, 697, 698, 703],
        "description": "这个道具可以生成跟班。"
    },
    "blue_spider": {
        "label_id": 38,
        "item_id": [145, 148, 151, 268, 434, 461, 480, 681, 693],
        "description": "这个道具可以生成蓝苍蝇。"
    },
    "blue_spider": {
        "label_id": 39,
        "item_id": [211, 217, 234, 266, 278, 280, 288, 367, 403, 461, 480, 575, 645, 717],
        "description": "这个道具可以生成蓝蜘蛛。"
    },
    "blood_clot": {
        "label_id": 40,
        "item_id": [713],
        "description": "这个道具可以生成血块。"
    },
    "small_shit": {
        "label_id": 41,
        "item_id": [576],
        "description": "这个道具可以生成粪滴。"
    },
    "attack_method": {
        "label_id": 42,
        "item_id": [69, 316, 597, 229, 68, 118, 329, 395, 52, 531, 114, 678, 168, 579, 713, 640, 152, 244, 399, 394, 572, 441, 643, 680],
        "description": "这个道具可以改变角色的攻击方式、或使角色获得额外的攻击方式。"
    },
    "watermark": {
        "label_id": 43,
        "item_id": [350, 317, 526, 56, 578, 231, 266, 502, 461, 469, 178, 308],
        "description": "这个道具可以生成非红色的水迹。"
    },
    "bomb": {
        "label_id": 44,
        "item_id": [727, 125, 563, 220, 353, 646, 583, 366, 209, 432, 140, 19, 256, 223, 517, 367, 190, 42, 137, 106, 483],
        "description": "这个道具的图标或名字中含有炸弹。"
    },
    "tears_fix_mul": {
        "label_id": 45,
        "item_id": [2, 52, 118, 149, 152, 153, 169, 229, 310, 330, 368, 406, 440, 531, 543, 561, 600, 651, 704],
        "description": "这个道具可以改变角色的射速修正(乘除法)。"
    },
    "tears_fix_add": {
        "label_id": 46,
        "item_id": [206, 222, 224, 228, 240, 258, 307, 309, 397, 407, 436, 442, 477, 481, 530, 549, 560, 567, 582, 589, 644, 695, 704],
        "description": "这个道具可以改变角色的射速修正(加减法)。"
    },
    "size_change": {
        "label_id": 47,
        "item_id": [598, 688, 438, 71, 340, 302, 12],
        "description": "这个道具可以改变角色的体型。"
    }
}

isaac_labels = {
    "angel": {
        "label_id": 1,
        "label_name": "天使",
        "description": "这个道具可以组成天使套装(撒拉弗！)。"
    },
    "baby": {
        "label_id": 2,
        "label_name": "宝宝",
        "description": "这个道具可以组成宝宝套装(连体！)。"
    },
    "battery": {
        "label_id": 3,
        "label_name": "电池",
        "description": "这个道具具有\"电池\"标签。"
    },
    "bob": {
        "label_id": 4,
        "label_name": "鲍勃",
        "description": "这个道具可以组成鲍勃套装(鲍勃！)。"
    },
    "book": {
        "label_id": 5,
        "label_name": "书",
        "description": "这个道具可以组成书套装(书虫！)。"
    },
    "dead": {
        "label_id": 6,
        "label_name": "死亡",
        "description": "这个道具具有\"死亡\"标签(用于解锁道具\"寄生虫\")。"
    },
    "devil": {
        "label_id": 7,
        "label_name": "恶魔",
        "description": "这个道具可以组成恶魔套装(利维坦！)。"
    },
    "fly": {
        "label_id": 8,
        "label_name": "苍蝇",
        "description": "这个道具可以组成苍蝇套装(别西卜！)。"
    },
    "food": {
        "label_id": 9,
        "label_name": "食物",
        "description": "在拥有道具\"大胃王\"后拾起这个道具，会得到额外属性加成。"
    },
    "guppy": {
        "label_id": 10,
        "label_name": "嗝屁猫",
        "description": "这个道具可以组成猫套装(嗝屁猫！)。"
    },
    "lazarusshared": {
        "label_id": 11,
        "label_name": "拉撒路共享",
        "description": "这个道具可以在堕化拉撒路的两种形态中共享所有效果。"
    },
    "lazarussharedglobal": {
        "label_id": 12,
        "label_name": "拉撒路全局共享",
        "description": "这个道具可以在堕化拉撒路的两种形态中共享除属性加成以外的效果。"
    },
    "mom": {
        "label_id": 13,
        "label_name": "妈妈",
        "description": "这个道具可以组成妈妈套装(好的妈妈？！)。"
    },
    "monstermanual": {
        "label_id": 14,
        "label_name": "怪物手册",
        "description": "这个道具对应的跟班可以被道具\"怪物手册\"召唤。",
        "weight": 0
    },
    "mushroom": {
        "label_id": 15,
        "label_name": "蘑菇",
        "description": "这个道具可以组成蘑菇套装(蘑菇头！)。"
    },
    "nocantrip": {
        "label_id": 16,
        "label_name": "非大量过牌",
        "description": "这个道具不会出现在挑战\"大量过牌\"的卡牌中。",
        "weight": 0
    },
    "nochallenge": {
        "label_id": 17,
        "label_name": "非挑战",
        "description": "这个道具不会出现在挑战中。"
    },
    "nodaliy": {
        "label_id": 18,
        "label_name": "非每日",
        "description": "这个道具不会出现在每日挑战中。<其实只有一个道具>"
    },
    "noeden": {
        "label_id": 19,
        "label_name": "非伊甸",
        "description": "这个道具不会作为伊甸、堕化伊甸、道具\"伊甸的祝福\"给予的初始道具。"
    },
    "nogreed": {
        "label_id": 20,
        "label_name": "非贪婪",
        "description": "这个道具不会出现在贪婪模式中。"
    },
    "nokeeper": {
        "label_id": 21,
        "label_name": "非店主",
        "description": "这个道具不会出现在店主、堕化店主的道具池中。<其实只有一个道具>"
    },
    "nolostbr": {
        "label_id": 22,
        "label_name": "非游魂长子名分",
        "description": "这个道具在游魂获得道具\"长子名分\"后，不会再生成。"
    },
    "offensive": {
        "label_id": 23, 
        "label_name": "攻击性",
        "description": "这个道具在堕化游魂的道具池中。"
    },
    "poop": {
        "label_id": 24,
        "label_name": "大便",
        "description": "这个道具可以组成大便套装(拉了！)。"
    },
    "quest": {
        "label_id": 25,
        "label_name": "任务",
        "description": "这个道具是任务(剧情)道具。"
    },
    "spider": {
        "label_id": 26,
        "label_name": "蜘蛛",
        "description": "这个道具可以组成蜘蛛套装(蜘蛛宝宝！)。"
    },
    "star": {
        "label_id": 27,
        "label_name": "星星",
        "description": "这个道具具有\"星星\"标签。"
    },
    "summonable": {
        "label_id": 28,
        "label_name": "可召唤",
        "description": "这个道具可以作为道具\"所罗门魔典\"的魂火跟班生成、以及被饰品\"塑形黏土\"随机生效。",
        "weight": 0
    },
    "syringe": {
        "label_id": 29,
        "label_name": "注射器",
        "description": "这个道具可以组成针套装(嗑药！)。"
    },
    "tearsup": {
        "label_id": 30,
        "label_name": "射速上升",
        "description": "这个道具具有\"射速上升\"标签。"
    },
    "tech": {
        "label_id": 31,
        "label_name": "科技",
        "description": "这个道具具有\"科技\"标签。"
    },
    "uniquefamiliar": {
        "label_id": 32,
        "label_name": "独特跟班",
        "description": "获得这个道具后产生的跟班不会被道具\"朋友盒\"或饰品\"双胞胎\"复制。"
    }
}

who_asked = [
    "我问了。",
    "没人问了。",
    "这个群里0人问了。",
    "Who asked?",
    "谁问你了？",
    "不知道，吃我一拳。",
    "不知道，吃c36去吧。",
    "不知道，来个错误技就老实了。"
]

sequence_word = [
    "还有，",
    "顺便，",
    "另外，"
]

r_please = [
    "r了吧，这把算你赢了。",
    "请你r吧。",
    "r了吧，我有个朋友看了说不太舒服。",
    "r了吧，对大家都好。",
    "r了吧。"
]