isaac_flavor_text = {
    "no12": {
        "id": [6, 378],
        "text": "大便当 饭，小便当 汤。"
    },
    "real_crap": {
        "id": [36],
        "text": "哦咩得多！也是吃上好的了。"
    },
    "oh_crap": {
        "id": [9, 36, 209, 236, 291, 378, 504, 543, 576, 680, 725],
        "text": "真香！"
    },
    "guppy": {
        "id": [81, 133, 134, 145, 187, 212, 665],
        "text": "爱猫TV启动！"
    },
    "bookworm": {
        "id": [33, 34, 35, 58, 65, 78, 97, 123, 192, 282, 287, 292, 545, 584, 712],
        "text": "知识就是力量。"
    },
    "dataminer": {
        "id": [489],
        "text": "XCSmDBRlDB5pNLmuhdGyg3WtECNlgLq2EBVlDBcagrZlfB4lDXGegBKxgHGtg3AeEXGagnGmNLmugLb="
    },
    "spun": {
        "id": [13, 14, 70, 143, 240, 345, 493, 496],
        "text": "给我家鸽子用的。"
    },
    "fun_guy": {
        "id": [11, 12, 71, 120, 121, 342, 398, 553, 582, 625],
        "text": "我说怎么踩到刺不掉血，原来我在天上飞啊。"
    },
    "TMTrainer": {
        "id": [721],
        "text": "\\\"TMTrainer\\\": {\\n\\t\\\"id\\\": [721],\\n\\\"text\\\": \\\"Default flavor text.\\\"}\\\""
    },
    "greatness": {
        "id": [691],
        "text": "注定伟大！"
    },
    "void": {
        "id": [477, 706],
        "text": "这下没得吃了..."
    },
    "lost": {
        "id": [612],
        "text": "饿啊..."
    },
    "binge_eater": {
        "id": [664],
        "text": "Bon appetit!"
    },
    "echo_chamber": {
        "id": [700],
        "text": "声室吧！室吧！吧！"
    },
    "angel": {
        "id": [33, 78, 101, 108, 182, 313, 331, 333, 334, 335, 499, 573],
        "text": "✝升天✝"
    },
    "bomb": {
        "id": [125, 220, 37, 131, 209, 250, 256, 353, 367, 432, 517, 563, 646, 727, 366, 614, 483, 190, 106, 19, 42, 65, 137, 140, 223, 583, 40, 401, 52, 371],
        "text": "爆！！！"
    },
    "bob": {
        "id": [42, 140, 149, 273],
        "text": "臭死了。"
    },
    "sharp": {
        "id": [114, 126, 486, 555, 443, 339, 656, 448, 627, 631],
        "text": "吃之前先在自己的手上改个花刀吧。"
    },
    "gulp": {
        "id": [538],
        "text": "Gulp!"
    }
}